# coding=utf-8

#################### class05 ####################

from Demo.demo import *

# 创建一个对象
# dog = Dog('dog')
# dog.bark()
# bdog = BDog('little')
# bdog.BBark()
# bdog.bark()

# 多重继承只会调第一个父类的init，需要重写init
# ldog = LittleDog('小小小狗')
# print(ldog.wname)


#################### 计算文件中的大写字母 ####################
# import os
#
# os.chdir('C:\\Users\\herozhu\\Desktop')
# with open(r'123.txt', encoding='gbk') as up:
#     count = 0
#     for i in up.read():
#         if i.isupper():
#             count += 1
#     print(count)

#################### 如何随机打乱列表中元素，要求不引用额外的内存空间 ####################
# import random
#
# # list1 = [33, 52, 59, 93, 52, 59, 93, 29, 92, 40, 51, 21, 42]
# list1 = [i for i in range(10, 0, -1)]
# random.shuffle(list1)
# print(list1)

#################### strip移除字符串头尾指定的字符 ####################
# a = ' d 44 4 5f 343   k4k5 '
# print(a.strip(' d'))
# print(a.lstrip(' d'))
# print(a.rstrip('5 '))
# print(a.replace('4 4', 'x'))

#################### 爱心 ####################
# print('\n'.join([''.join([('Love'[(x-y) % len('Love')] if ((x*0.05)**2+(y*0.1)**2-1)**3-(x*0.05)**2*(y*0.1)**3 <= 0else' ') for x in range(-30, 30)]) for y in range(15, -15, -1)]))

#################### split ####################
# url = "http://www.baidu.com/python/image/123456.jpg"
# # 以“.” 进行分隔
# path =url.split("/")
# print(path)

####################  ####################




####################  ####################




####################  ####################



####################  ####################




####################  ####################



####################  ####################




####################  ####################



####################  ####################




####################  ####################



####################  ####################




####################  ####################



